MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA610/mcu.h
extern volatile IOCPDDBITS IOCPDDbits __attribute__((__sfr__));

#define TRISE TRISE
extern volatile uint16_t TRISE __attribute__((__sfr__));
typedef struct tagTRISEBITS {
  uint16_t TRISE0:1;
  uint16_t TRISE1:1;
  uint16_t TRISE2:1;
  uint16_t TRISE3:1;
  uint16_t TRISE4:1;
  uint16_t TRISE5:1;
  uint16_t TRISE6:1;
  uint16_t TRISE7:1;
  uint16_t TRISE8:1;
  uint16_t TRISE9:1;
} TRISEBITS;
extern volatile TRISEBITS TRISEbits __attribute__((__sfr__));

#define PORTE PORTE
extern volatile uint16_t PORTE __attribute__((__sfr__));
typedef struct tagPORTEBITS {
  uint16_t RE0:1;
  uint16_t RE1:1;
  uint16_t RE2:1;
  uint16_t RE3:1;
  uint16_t RE4:1;
  uint16_t RE5:1;
  uint16_t RE6:1;
  uint16_t RE7:1;
  uint16_t RE8:1;
  uint16_t RE9:1;
} PORTEBITS;
extern volatile PORTEBITS PORTEbits __attribute__((__sfr__));

#define LATE LATE
extern volatile uint16_t LATE __attribute__((__sfr__));
typedef struct tagLATEBITS {
  uint16_t LATE0:1;
  uint16_t LATE1:1;
  uint16_t LATE2:1;
  uint16_t LATE3:1;
  uint16_t LATE4:1;
  uint16_t LATE5:1;
  uint16_t LATE6:1;
  uint16_t LATE7:1;
  uint16_t LATE8:1;
  uint16_t LATE9:1;
} LATEBITS;
extern volatile LATEBITS LATEbits __attribute__((__sfr__));

#define ODCE ODCE
extern volatile uint16_t ODCE __attribute__((__sfr__));
typedef struct tagODCEBITS {
  uint16_t ODCE0:1;
  uint16_t ODCE1:1;
  uint16_t ODCE2:1;
  uint16_t ODCE3:1;
  uint16_t ODCE4:1;
  uint16_t ODCE5:1;
  uint16_t ODCE6:1;
  uint16_t ODCE7:1;
  uint16_t ODCE8:1;
  uint16_t ODCE9:1;
} ODCEBITS;
extern volatile ODCEBITS ODCEbits __attribute__((__sfr__));

#define ANSE ANSE
extern volatile uint16_t ANSE __attribute__((__sfr__));
__extension__ typedef struct tagANSEBITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ANSE4:1;
      uint16_t :4;
      uint16_t ANSE9:1;
    };
    struct {
      uint16_t :4;
      uint16_t ANSELE4:1;
      uint16_t :4;
      uint16_t ANSELE9:1;
    };
  };
} ANSEBITS;
extern volatile ANSEBITS ANSEbits __attribute__((__sfr__));

#define ANSELE ANSELE
extern volatile uint16_t ANSELE __attribute__((__sfr__));
__extension__ typedef struct tagANSELEBITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ANSE4:1;
      uint16_t :4;
      uint16_t ANSE9:1;
    };
    struct {
      uint16_t :4;
      uint16_t ANSELE4:1;
      uint16_t :4;
      uint16_t ANSELE9:1;
    };
  };
} ANSELEBITS;
extern volatile ANSELEBITS ANSELEbits __attribute__((__sfr__));

#define IOCPE IOCPE
extern volatile uint16_t IOCPE __attribute__((__sfr__));
typedef struct tagIOCPEBITS {
  uint16_t IOCPE0:1;
  uint16_t IOCPE1:1;
  uint16_t IOCPE2:1;
  uint16_t IOCPE3:1;
  uint16_t IOCPE4:1;
  uint16_t IOCPE5:1;
  uint16_t IOCPE6:1;
  uint16_t IOCPE7:1;
  uint16_t IOCPE8:1;
  uint16_t IOCPE9:1;
} IOCPEBITS;
extern volatile IOCPEBITS IOCPEbits __attribute__((__sfr__));

#define IOCNE IOCNE
extern volatile uint16_t IOCNE __attribute__((__sfr__));
typedef struct tagIOCNEBITS {
  uint16_t IOCNE0:1;
  uint16_t IOCNE1:1;
  uint16_t IOCNE2:1;
  uint16_t IOCNE3:1;
  uint16_t IOCNE4:1;
  uint16_t IOCNE5:1;
  uint16_t IOCNE6:1;
  uint16_t IOCNE7:1;
  uint16_t IOCNE8:1;
  uint16_t IOCNE9:1;
} IOCNEBITS;
extern volatile IOCNEBITS IOCNEbits __attribute__((__sfr__));

#define IOCFE IOCFE
extern volatile uint16_t IOCFE __attribute__((__sfr__));
typedef struct tagIOCFEBITS {
  uint16_t IOCFE0:1;
  uint16_t IOCFE1:1;
  uint16_t IOCFE2:1;
  uint16_t IOCFE3:1;
  uint16_t IOCFE4:1;
  uint16_t IOCFE5:1;
  uint16_t IOCFE6:1;
  uint16_t IOCFE7:1;
  uint16_t IOCFE8:1;
  uint16_t IOCFE9:1;
} IOCFEBITS;
extern volatile IOCFEBITS IOCFEbits __attribute__((__sfr__));

#define CNPUE CNPUE
extern volatile uint16_t CNPUE __attribute__((__sfr__));
__extension__ typedef struct tagCNPUEBITS {
  union {
    struct {
      uint16_t IOCPE0:1;
      uint16_t IOCPE1:1;
      uint16_t IOCPE2:1;
      uint16_t IOCPE3:1;
      uint16_t IOCPE4:1;
      uint16_t IOCPE5:1;
      uint16_t IOCPE6:1;
      uint16_t IOCPE7:1;
      uint16_t IOCPE8:1;
      uint16_t IOCPE9:1;
    };
    struct {
      uint16_t IOCPUE0:1;
      uint16_t IOCPUE1:1;
      uint16_t IOCPUE2:1;
      uint16_t IOCPUE3:1;
      uint16_t IOCPUE4:1;
      uint16_t IOCPUE5:1;
      uint16_t IOCPUE6:1;
      uint16_t IOCPUE7:1;
      uint16_t IOCPUE8:1;
      uint16_t IOCPUE9:1;
    };
    struct {
      uint16_t CNPUE0:1;
      uint16_t CNPUE1:1;
      uint16_t CNPUE2:1;
      uint16_t CNPUE3:1;
      uint16_t CNPUE4:1;
      uint16_t CNPUE5:1;
      uint16_t CNPUE6:1;
      uint16_t CNPUE7:1;
      uint16_t CNPUE8:1;
      uint16_t CNPUE9:1;
    };
  };
} CNPUEBITS;
extern volatile CNPUEBITS CNPUEbits __attribute__((__sfr__));

#define IOCPUE IOCPUE
extern volatile uint16_t IOCPUE __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUEBITS {
  union {
    struct {
      uint16_t IOCPE0:1;
      uint16_t IOCPE1:1;
      uint16_t IOCPE2:1;
      uint16_t IOCPE3:1;
      uint16_t IOCPE4:1;
      uint16_t IOCPE5:1;
      uint16_t IOCPE6:1;
      uint16_t IOCPE7:1;
      uint16_t IOCPE8:1;
      uint16_t IOCPE9:1;
    };
    struct {
      uint16_t IOCPUE0:1;
      uint16_t IOCPUE1:1;
      uint16_t IOCPUE2:1;
      uint16_t IOCPUE3:1;
      uint16_t IOCPUE4:1;
      uint16_t IOCPUE5:1;
      uint16_t IOCPUE6:1;
      uint16_t IOCPUE7:1;
      uint16_t IOCPUE8:1;
      uint16_t IOCPUE9:1;
    };
    struct {
      uint16_t CNPUE0:1;
      uint16_t CNPUE1:1;
      uint16_t CNPUE2:1;
      uint16_t CNPUE3:1;
      uint16_t CNPUE4:1;
      uint16_t CNPUE5:1;
      uint16_t CNPUE6:1;
      uint16_t CNPUE7:1;
      uint16_t CNPUE8:1;
      uint16_t CNPUE9:1;
    };
  };
} IOCPUEBITS;
extern volatile IOCPUEBITS IOCPUEbits __attribute__((__sfr__));

#define CNPDE CNPDE
extern volatile uint16_t CNPDE __attribute__((__sfr__));
__extension__ typedef struct tagCNPDEBITS {
  union {
    struct {
      uint16_t IOCPDE0:1;
      uint16_t IOCPDE1:1;
      uint16_t IOCPDE2:1;
      uint16_t IOCPDE3:1;
      uint16_t IOCPDE4:1;
      uint16_t IOCPDE5:1;
      uint16_t IOCPDE6:1;
      uint16_t IOCPDE7:1;
      uint16_t IOCPDE8:1;
      uint16_t IOCPDE9:1;
    };
    struct {
      uint16_t CNPDE0:1;
      uint16_t CNPDE1:1;
      uint16_t CNPDE2:1;
      uint16_t CNPDE3:1;
      uint16_t CNPDE4:1;
      uint16_t CNPDE5:1;
      uint16_t CNPDE6:1;
      uint16_t CNPDE7:1;
      uint16_t CNPDE8:1;
      uint16_t CNPDE9:1;
    };
  };
} CNPDEBITS;
extern volatile CNPDEBITS CNPDEbits __attribute__((__sfr__));

#define IOCPDE IOCPDE
extern volatile uint16_t IOCPDE __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDEBITS {
  union {
    struct {
      uint16_t IOCPDE0:1;
      uint16_t IOCPDE1:1;
      uint16_t IOCPDE2:1;
      uint16_t IOCPDE3:1;
      uint16_t IOCPDE4:1;
      uint16_t IOCPDE5:1;
      uint16_t IOCPDE6:1;
      uint16_t IOCPDE7:1;
      uint16_t IOCPDE8:1;
      uint16_t IOCPDE9:1;
    };
    struct {
      uint16_t CNPDE0:1;
      uint16_t CNPDE1:1;
      uint16_t CNPDE2:1;
      uint16_t CNPDE3:1;
      uint16_t CNPDE4:1;
      uint16_t CNPDE5:1;
      uint16_t CNPDE6:1;
      uint16_t CNPDE7:1;
      uint16_t CNPDE8:1;
      uint16_t CNPDE9:1;
    };
  };
} IOCPDEBITS;
extern volatile IOCPDEBITS IOCPDEbits __attribute__((__sfr__));

#define TRISF TRISF
extern volatile uint16_t TRISF __attribute__((__sfr__));
typedef struct tagTRISFBITS {
  uint16_t TRISF0:1;
  uint16_t TRISF1:1;
  uint16_t TRISF2:1;
  uint16_t TRISF3:1;
  uint16_t TRISF4:1;
  uint16_t TRISF5:1;
  uint16_t TRISF6:1;
  uint16_t TRISF7:1;
  uint16_t TRISF8:1;
  uint16_t :3;
  uint16_t TRISF12:1;
  uint16_t TRISF13:1;
} TRISFBITS;
