MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA610/mcu.h
#define _PMCON2_RADDR16_POSITION                 0x00000000
#define _PMCON2_RADDR16_MASK                     0x00000001
#define _PMCON2_RADDR16_LENGTH                   0x00000001

#define _PMCON2_RADDR17_POSITION                 0x00000001
#define _PMCON2_RADDR17_MASK                     0x00000002
#define _PMCON2_RADDR17_LENGTH                   0x00000001

#define _PMCON2_RADDR18_POSITION                 0x00000002
#define _PMCON2_RADDR18_MASK                     0x00000004
#define _PMCON2_RADDR18_LENGTH                   0x00000001

#define _PMCON2_RADDR19_POSITION                 0x00000003
#define _PMCON2_RADDR19_MASK                     0x00000008
#define _PMCON2_RADDR19_LENGTH                   0x00000001

#define _PMCON2_RADDR20_POSITION                 0x00000004
#define _PMCON2_RADDR20_MASK                     0x00000010
#define _PMCON2_RADDR20_LENGTH                   0x00000001

#define _PMCON2_RADDR21_POSITION                 0x00000005
#define _PMCON2_RADDR21_MASK                     0x00000020
#define _PMCON2_RADDR21_LENGTH                   0x00000001

#define _PMCON2_RADDR22_POSITION                 0x00000006
#define _PMCON2_RADDR22_MASK                     0x00000040
#define _PMCON2_RADDR22_LENGTH                   0x00000001

#define _PMCON2_RADDR23_POSITION                 0x00000007
#define _PMCON2_RADDR23_MASK                     0x00000080
#define _PMCON2_RADDR23_LENGTH                   0x00000001

#define _PMCON3_PTEN16_POSITION                  0x00000000
#define _PMCON3_PTEN16_MASK                      0x00000001
#define _PMCON3_PTEN16_LENGTH                    0x00000001

#define _PMCON3_PTEN17_POSITION                  0x00000001
#define _PMCON3_PTEN17_MASK                      0x00000002
#define _PMCON3_PTEN17_LENGTH                    0x00000001

#define _PMCON3_PTEN18_POSITION                  0x00000002
#define _PMCON3_PTEN18_MASK                      0x00000004
#define _PMCON3_PTEN18_LENGTH                    0x00000001

#define _PMCON3_PTEN19_POSITION                  0x00000003
#define _PMCON3_PTEN19_MASK                      0x00000008
#define _PMCON3_PTEN19_LENGTH                    0x00000001

#define _PMCON3_PTEN20_POSITION                  0x00000004
#define _PMCON3_PTEN20_MASK                      0x00000010
#define _PMCON3_PTEN20_LENGTH                    0x00000001

#define _PMCON3_PTEN21_POSITION                  0x00000005
#define _PMCON3_PTEN21_MASK                      0x00000020
#define _PMCON3_PTEN21_LENGTH                    0x00000001

#define _PMCON3_PTEN22_POSITION                  0x00000006
#define _PMCON3_PTEN22_MASK                      0x00000040
#define _PMCON3_PTEN22_LENGTH                    0x00000001

#define _PMCON3_AWAITE_POSITION                  0x00000008
#define _PMCON3_AWAITE_MASK                      0x00000100
#define _PMCON3_AWAITE_LENGTH                    0x00000001

#define _PMCON3_AWAITM_POSITION                  0x00000009
#define _PMCON3_AWAITM_MASK                      0x00000600
#define _PMCON3_AWAITM_LENGTH                    0x00000002

#define _PMCON3_PTBE0EN_POSITION                 0x0000000C
#define _PMCON3_PTBE0EN_MASK                     0x00001000
#define _PMCON3_PTBE0EN_LENGTH                   0x00000001

#define _PMCON3_PTBE1EN_POSITION                 0x0000000D
#define _PMCON3_PTBE1EN_MASK                     0x00002000
#define _PMCON3_PTBE1EN_LENGTH                   0x00000001

#define _PMCON3_PTRDEN_POSITION                  0x0000000E
#define _PMCON3_PTRDEN_MASK                      0x00004000
#define _PMCON3_PTRDEN_LENGTH                    0x00000001

#define _PMCON3_PTWREN_POSITION                  0x0000000F
#define _PMCON3_PTWREN_MASK                      0x00008000
#define _PMCON3_PTWREN_LENGTH                    0x00000001

#define _PMCON3_AWAITM0_POSITION                 0x00000009
#define _PMCON3_AWAITM0_MASK                     0x00000200
#define _PMCON3_AWAITM0_LENGTH                   0x00000001

#define _PMCON3_AWAITM1_POSITION                 0x0000000A
#define _PMCON3_AWAITM1_MASK                     0x00000400
#define _PMCON3_AWAITM1_LENGTH                   0x00000001

#define _PMCON4_PTEN0_POSITION                   0x00000000
#define _PMCON4_PTEN0_MASK                       0x00000001
#define _PMCON4_PTEN0_LENGTH                     0x00000001

#define _PMCON4_PTEN1_POSITION                   0x00000001
#define _PMCON4_PTEN1_MASK                       0x00000002
#define _PMCON4_PTEN1_LENGTH                     0x00000001

#define _PMCON4_PTEN2_POSITION                   0x00000002
#define _PMCON4_PTEN2_MASK                       0x00000004
#define _PMCON4_PTEN2_LENGTH                     0x00000001

#define _PMCON4_PTEN3_POSITION                   0x00000003
#define _PMCON4_PTEN3_MASK                       0x00000008
#define _PMCON4_PTEN3_LENGTH                     0x00000001

#define _PMCON4_PTEN4_POSITION                   0x00000004
#define _PMCON4_PTEN4_MASK                       0x00000010
#define _PMCON4_PTEN4_LENGTH                     0x00000001

#define _PMCON4_PTEN5_POSITION                   0x00000005
#define _PMCON4_PTEN5_MASK                       0x00000020
#define _PMCON4_PTEN5_LENGTH                     0x00000001

#define _PMCON4_PTEN6_POSITION                   0x00000006
#define _PMCON4_PTEN6_MASK                       0x00000040
#define _PMCON4_PTEN6_LENGTH                     0x00000001

#define _PMCON4_PTEN7_POSITION                   0x00000007
#define _PMCON4_PTEN7_MASK                       0x00000080
#define _PMCON4_PTEN7_LENGTH                     0x00000001

#define _PMCON4_PTEN8_POSITION                   0x00000008
#define _PMCON4_PTEN8_MASK                       0x00000100
#define _PMCON4_PTEN8_LENGTH                     0x00000001

#define _PMCON4_PTEN9_POSITION                   0x00000009
#define _PMCON4_PTEN9_MASK                       0x00000200
#define _PMCON4_PTEN9_LENGTH                     0x00000001

#define _PMCON4_PTEN10_POSITION                  0x0000000A
#define _PMCON4_PTEN10_MASK                      0x00000400
#define _PMCON4_PTEN10_LENGTH                    0x00000001

