MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA610/mcu.h
#define _SPI3CON1_CKE_POSITION                   0x00000008
#define _SPI3CON1_CKE_MASK                       0x00000100
#define _SPI3CON1_CKE_LENGTH                     0x00000001

#define _SPI3CON1_SMP_POSITION                   0x00000009
#define _SPI3CON1_SMP_MASK                       0x00000200
#define _SPI3CON1_SMP_LENGTH                     0x00000001

#define _SPI3CON1_MODE16_POSITION                0x0000000A
#define _SPI3CON1_MODE16_MASK                    0x00000400
#define _SPI3CON1_MODE16_LENGTH                  0x00000001

#define _SPI3CON1_MODE32_POSITION                0x0000000B
#define _SPI3CON1_MODE32_MASK                    0x00000800
#define _SPI3CON1_MODE32_LENGTH                  0x00000001

#define _SPI3CON1_DISSDO_POSITION                0x0000000C
#define _SPI3CON1_DISSDO_MASK                    0x00001000
#define _SPI3CON1_DISSDO_LENGTH                  0x00000001

#define _SPI3CON1_SPISIDL_POSITION               0x0000000D
#define _SPI3CON1_SPISIDL_MASK                   0x00002000
#define _SPI3CON1_SPISIDL_LENGTH                 0x00000001

#define _SPI3CON1_SPIEN_POSITION                 0x0000000F
#define _SPI3CON1_SPIEN_MASK                     0x00008000
#define _SPI3CON1_SPIEN_LENGTH                   0x00000001

#define _SPI3CON1_MODE_POSITION                  0x0000000A
#define _SPI3CON1_MODE_MASK                      0x00000C00
#define _SPI3CON1_MODE_LENGTH                    0x00000002

#define _SPI3CON1L_ENHBUF_POSITION               0x00000000
#define _SPI3CON1L_ENHBUF_MASK                   0x00000001
#define _SPI3CON1L_ENHBUF_LENGTH                 0x00000001

#define _SPI3CON1L_SPIFE_POSITION                0x00000001
#define _SPI3CON1L_SPIFE_MASK                    0x00000002
#define _SPI3CON1L_SPIFE_LENGTH                  0x00000001

#define _SPI3CON1L_MCLKEN_POSITION               0x00000002
#define _SPI3CON1L_MCLKEN_MASK                   0x00000004
#define _SPI3CON1L_MCLKEN_LENGTH                 0x00000001

#define _SPI3CON1L_DISSCK_POSITION               0x00000003
#define _SPI3CON1L_DISSCK_MASK                   0x00000008
#define _SPI3CON1L_DISSCK_LENGTH                 0x00000001

#define _SPI3CON1L_DISSDI_POSITION               0x00000004
#define _SPI3CON1L_DISSDI_MASK                   0x00000010
#define _SPI3CON1L_DISSDI_LENGTH                 0x00000001

#define _SPI3CON1L_MSTEN_POSITION                0x00000005
#define _SPI3CON1L_MSTEN_MASK                    0x00000020
#define _SPI3CON1L_MSTEN_LENGTH                  0x00000001

#define _SPI3CON1L_CKP_POSITION                  0x00000006
#define _SPI3CON1L_CKP_MASK                      0x00000040
#define _SPI3CON1L_CKP_LENGTH                    0x00000001

#define _SPI3CON1L_SSEN_POSITION                 0x00000007
#define _SPI3CON1L_SSEN_MASK                     0x00000080
#define _SPI3CON1L_SSEN_LENGTH                   0x00000001

#define _SPI3CON1L_CKE_POSITION                  0x00000008
#define _SPI3CON1L_CKE_MASK                      0x00000100
#define _SPI3CON1L_CKE_LENGTH                    0x00000001

#define _SPI3CON1L_SMP_POSITION                  0x00000009
#define _SPI3CON1L_SMP_MASK                      0x00000200
#define _SPI3CON1L_SMP_LENGTH                    0x00000001

#define _SPI3CON1L_MODE16_POSITION               0x0000000A
#define _SPI3CON1L_MODE16_MASK                   0x00000400
#define _SPI3CON1L_MODE16_LENGTH                 0x00000001

#define _SPI3CON1L_MODE32_POSITION               0x0000000B
#define _SPI3CON1L_MODE32_MASK                   0x00000800
#define _SPI3CON1L_MODE32_LENGTH                 0x00000001

#define _SPI3CON1L_DISSDO_POSITION               0x0000000C
#define _SPI3CON1L_DISSDO_MASK                   0x00001000
#define _SPI3CON1L_DISSDO_LENGTH                 0x00000001

#define _SPI3CON1L_SPISIDL_POSITION              0x0000000D
#define _SPI3CON1L_SPISIDL_MASK                  0x00002000
#define _SPI3CON1L_SPISIDL_LENGTH                0x00000001

#define _SPI3CON1L_SPIEN_POSITION                0x0000000F
#define _SPI3CON1L_SPIEN_MASK                    0x00008000
#define _SPI3CON1L_SPIEN_LENGTH                  0x00000001

#define _SPI3CON1L_MODE_POSITION                 0x0000000A
#define _SPI3CON1L_MODE_MASK                     0x00000C00
#define _SPI3CON1L_MODE_LENGTH                   0x00000002

#define _SPI3CON1H_FRMCNT_POSITION               0x00000000
#define _SPI3CON1H_FRMCNT_MASK                   0x00000007
#define _SPI3CON1H_FRMCNT_LENGTH                 0x00000003

#define _SPI3CON1H_FRMSYPW_POSITION              0x00000003
#define _SPI3CON1H_FRMSYPW_MASK                  0x00000008
#define _SPI3CON1H_FRMSYPW_LENGTH                0x00000001

#define _SPI3CON1H_MSSEN_POSITION                0x00000004
#define _SPI3CON1H_MSSEN_MASK                    0x00000010
#define _SPI3CON1H_MSSEN_LENGTH                  0x00000001

#define _SPI3CON1H_FRMPOL_POSITION               0x00000005
#define _SPI3CON1H_FRMPOL_MASK                   0x00000020
#define _SPI3CON1H_FRMPOL_LENGTH                 0x00000001

#define _SPI3CON1H_FRMSYNC_POSITION              0x00000006
#define _SPI3CON1H_FRMSYNC_MASK                  0x00000040
#define _SPI3CON1H_FRMSYNC_LENGTH                0x00000001

#define _SPI3CON1H_FRMEN_POSITION                0x00000007
#define _SPI3CON1H_FRMEN_MASK                    0x00000080
#define _SPI3CON1H_FRMEN_LENGTH                  0x00000001

#define _SPI3CON1H_AUDMOD_POSITION               0x00000008
#define _SPI3CON1H_AUDMOD_MASK                   0x00000300
#define _SPI3CON1H_AUDMOD_LENGTH                 0x00000002

#define _SPI3CON1H_URDTEN_POSITION               0x0000000A
#define _SPI3CON1H_URDTEN_MASK                   0x00000400
#define _SPI3CON1H_URDTEN_LENGTH                 0x00000001

#define _SPI3CON1H_AUDMONO_POSITION              0x0000000B
#define _SPI3CON1H_AUDMONO_MASK                  0x00000800
#define _SPI3CON1H_AUDMONO_LENGTH                0x00000001

#define _SPI3CON1H_IGNTUR_POSITION               0x0000000C
#define _SPI3CON1H_IGNTUR_MASK                   0x00001000
#define _SPI3CON1H_IGNTUR_LENGTH                 0x00000001

#define _SPI3CON1H_IGNROV_POSITION               0x0000000D
#define _SPI3CON1H_IGNROV_MASK                   0x00002000
#define _SPI3CON1H_IGNROV_LENGTH                 0x00000001

#define _SPI3CON1H_SPISGNEXT_POSITION            0x0000000E
#define _SPI3CON1H_SPISGNEXT_MASK                0x00004000
#define _SPI3CON1H_SPISGNEXT_LENGTH              0x00000001

#define _SPI3CON1H_AUDEN_POSITION                0x0000000F
#define _SPI3CON1H_AUDEN_MASK                    0x00008000
#define _SPI3CON1H_AUDEN_LENGTH                  0x00000001

#define _SPI3CON1H_FRMCNT0_POSITION              0x00000000
#define _SPI3CON1H_FRMCNT0_MASK                  0x00000001
#define _SPI3CON1H_FRMCNT0_LENGTH                0x00000001

#define _SPI3CON1H_FRMCNT1_POSITION              0x00000001
#define _SPI3CON1H_FRMCNT1_MASK                  0x00000002
#define _SPI3CON1H_FRMCNT1_LENGTH                0x00000001

#define _SPI3CON1H_FRMCNT2_POSITION              0x00000002
#define _SPI3CON1H_FRMCNT2_MASK                  0x00000004
#define _SPI3CON1H_FRMCNT2_LENGTH                0x00000001

#define _SPI3CON1H_AUDMOD0_POSITION              0x00000008
#define _SPI3CON1H_AUDMOD0_MASK                  0x00000100
#define _SPI3CON1H_AUDMOD0_LENGTH                0x00000001

#define _SPI3CON1H_AUDMOD1_POSITION              0x00000009
#define _SPI3CON1H_AUDMOD1_MASK                  0x00000200
#define _SPI3CON1H_AUDMOD1_LENGTH                0x00000001

#define _SPI3CON2_FRMCNT_POSITION                0x00000000
#define _SPI3CON2_FRMCNT_MASK                    0x00000007
#define _SPI3CON2_FRMCNT_LENGTH                  0x00000003

#define _SPI3CON2_FRMSYPW_POSITION               0x00000003
#define _SPI3CON2_FRMSYPW_MASK                   0x00000008
#define _SPI3CON2_FRMSYPW_LENGTH                 0x00000001

