MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA610/mcu.h
#define _IOCPUA_CNPUA6_POSITION                  0x00000006
#define _IOCPUA_CNPUA6_MASK                      0x00000040
#define _IOCPUA_CNPUA6_LENGTH                    0x00000001

#define _IOCPUA_CNPUA7_POSITION                  0x00000007
#define _IOCPUA_CNPUA7_MASK                      0x00000080
#define _IOCPUA_CNPUA7_LENGTH                    0x00000001

#define _IOCPUA_CNPUA9_POSITION                  0x00000009
#define _IOCPUA_CNPUA9_MASK                      0x00000200
#define _IOCPUA_CNPUA9_LENGTH                    0x00000001

#define _IOCPUA_CNPUA10_POSITION                 0x0000000A
#define _IOCPUA_CNPUA10_MASK                     0x00000400
#define _IOCPUA_CNPUA10_LENGTH                   0x00000001

#define _IOCPUA_CNPUA14_POSITION                 0x0000000E
#define _IOCPUA_CNPUA14_MASK                     0x00004000
#define _IOCPUA_CNPUA14_LENGTH                   0x00000001

#define _IOCPUA_CNPUA15_POSITION                 0x0000000F
#define _IOCPUA_CNPUA15_MASK                     0x00008000
#define _IOCPUA_CNPUA15_LENGTH                   0x00000001

#define _CNPDA_IOCPDA0_POSITION                  0x00000000
#define _CNPDA_IOCPDA0_MASK                      0x00000001
#define _CNPDA_IOCPDA0_LENGTH                    0x00000001

#define _CNPDA_IOCPDA1_POSITION                  0x00000001
#define _CNPDA_IOCPDA1_MASK                      0x00000002
#define _CNPDA_IOCPDA1_LENGTH                    0x00000001

#define _CNPDA_IOCPDA2_POSITION                  0x00000002
#define _CNPDA_IOCPDA2_MASK                      0x00000004
#define _CNPDA_IOCPDA2_LENGTH                    0x00000001

#define _CNPDA_IOCPDA3_POSITION                  0x00000003
#define _CNPDA_IOCPDA3_MASK                      0x00000008
#define _CNPDA_IOCPDA3_LENGTH                    0x00000001

#define _CNPDA_IOCPDA4_POSITION                  0x00000004
#define _CNPDA_IOCPDA4_MASK                      0x00000010
#define _CNPDA_IOCPDA4_LENGTH                    0x00000001

#define _CNPDA_IOCPDA5_POSITION                  0x00000005
#define _CNPDA_IOCPDA5_MASK                      0x00000020
#define _CNPDA_IOCPDA5_LENGTH                    0x00000001

#define _CNPDA_IOCPDA6_POSITION                  0x00000006
#define _CNPDA_IOCPDA6_MASK                      0x00000040
#define _CNPDA_IOCPDA6_LENGTH                    0x00000001

#define _CNPDA_IOCPDA7_POSITION                  0x00000007
#define _CNPDA_IOCPDA7_MASK                      0x00000080
#define _CNPDA_IOCPDA7_LENGTH                    0x00000001

#define _CNPDA_IOCPDA9_POSITION                  0x00000009
#define _CNPDA_IOCPDA9_MASK                      0x00000200
#define _CNPDA_IOCPDA9_LENGTH                    0x00000001

#define _CNPDA_IOCPDA10_POSITION                 0x0000000A
#define _CNPDA_IOCPDA10_MASK                     0x00000400
#define _CNPDA_IOCPDA10_LENGTH                   0x00000001

#define _CNPDA_IOCPDA14_POSITION                 0x0000000E
#define _CNPDA_IOCPDA14_MASK                     0x00004000
#define _CNPDA_IOCPDA14_LENGTH                   0x00000001

#define _CNPDA_IOCPDA15_POSITION                 0x0000000F
#define _CNPDA_IOCPDA15_MASK                     0x00008000
#define _CNPDA_IOCPDA15_LENGTH                   0x00000001

#define _CNPDA_CNPDA0_POSITION                   0x00000000
#define _CNPDA_CNPDA0_MASK                       0x00000001
#define _CNPDA_CNPDA0_LENGTH                     0x00000001

#define _CNPDA_CNPDA1_POSITION                   0x00000001
#define _CNPDA_CNPDA1_MASK                       0x00000002
#define _CNPDA_CNPDA1_LENGTH                     0x00000001

#define _CNPDA_CNPDA2_POSITION                   0x00000002
#define _CNPDA_CNPDA2_MASK                       0x00000004
#define _CNPDA_CNPDA2_LENGTH                     0x00000001

#define _CNPDA_CNPDA3_POSITION                   0x00000003
#define _CNPDA_CNPDA3_MASK                       0x00000008
#define _CNPDA_CNPDA3_LENGTH                     0x00000001

#define _CNPDA_CNPDA4_POSITION                   0x00000004
#define _CNPDA_CNPDA4_MASK                       0x00000010
#define _CNPDA_CNPDA4_LENGTH                     0x00000001

#define _CNPDA_CNPDA5_POSITION                   0x00000005
#define _CNPDA_CNPDA5_MASK                       0x00000020
#define _CNPDA_CNPDA5_LENGTH                     0x00000001

#define _CNPDA_CNPDA6_POSITION                   0x00000006
#define _CNPDA_CNPDA6_MASK                       0x00000040
#define _CNPDA_CNPDA6_LENGTH                     0x00000001

#define _CNPDA_CNPDA7_POSITION                   0x00000007
#define _CNPDA_CNPDA7_MASK                       0x00000080
#define _CNPDA_CNPDA7_LENGTH                     0x00000001

#define _CNPDA_CNPDA9_POSITION                   0x00000009
#define _CNPDA_CNPDA9_MASK                       0x00000200
#define _CNPDA_CNPDA9_LENGTH                     0x00000001

#define _CNPDA_CNPDA10_POSITION                  0x0000000A
#define _CNPDA_CNPDA10_MASK                      0x00000400
#define _CNPDA_CNPDA10_LENGTH                    0x00000001

#define _CNPDA_CNPDA14_POSITION                  0x0000000E
#define _CNPDA_CNPDA14_MASK                      0x00004000
#define _CNPDA_CNPDA14_LENGTH                    0x00000001

#define _CNPDA_CNPDA15_POSITION                  0x0000000F
#define _CNPDA_CNPDA15_MASK                      0x00008000
#define _CNPDA_CNPDA15_LENGTH                    0x00000001

#define _IOCPDA_IOCPDA0_POSITION                 0x00000000
#define _IOCPDA_IOCPDA0_MASK                     0x00000001
#define _IOCPDA_IOCPDA0_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA1_POSITION                 0x00000001
#define _IOCPDA_IOCPDA1_MASK                     0x00000002
#define _IOCPDA_IOCPDA1_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA2_POSITION                 0x00000002
#define _IOCPDA_IOCPDA2_MASK                     0x00000004
#define _IOCPDA_IOCPDA2_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA3_POSITION                 0x00000003
#define _IOCPDA_IOCPDA3_MASK                     0x00000008
#define _IOCPDA_IOCPDA3_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA4_POSITION                 0x00000004
#define _IOCPDA_IOCPDA4_MASK                     0x00000010
#define _IOCPDA_IOCPDA4_LENGTH                   0x00000001

