MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA610/mcu.h
#define _IOCPDA_IOCPDA5_POSITION                 0x00000005
#define _IOCPDA_IOCPDA5_MASK                     0x00000020
#define _IOCPDA_IOCPDA5_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA6_POSITION                 0x00000006
#define _IOCPDA_IOCPDA6_MASK                     0x00000040
#define _IOCPDA_IOCPDA6_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA7_POSITION                 0x00000007
#define _IOCPDA_IOCPDA7_MASK                     0x00000080
#define _IOCPDA_IOCPDA7_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA9_POSITION                 0x00000009
#define _IOCPDA_IOCPDA9_MASK                     0x00000200
#define _IOCPDA_IOCPDA9_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA10_POSITION                0x0000000A
#define _IOCPDA_IOCPDA10_MASK                    0x00000400
#define _IOCPDA_IOCPDA10_LENGTH                  0x00000001

#define _IOCPDA_IOCPDA14_POSITION                0x0000000E
#define _IOCPDA_IOCPDA14_MASK                    0x00004000
#define _IOCPDA_IOCPDA14_LENGTH                  0x00000001

#define _IOCPDA_IOCPDA15_POSITION                0x0000000F
#define _IOCPDA_IOCPDA15_MASK                    0x00008000
#define _IOCPDA_IOCPDA15_LENGTH                  0x00000001

#define _IOCPDA_CNPDA0_POSITION                  0x00000000
#define _IOCPDA_CNPDA0_MASK                      0x00000001
#define _IOCPDA_CNPDA0_LENGTH                    0x00000001

#define _IOCPDA_CNPDA1_POSITION                  0x00000001
#define _IOCPDA_CNPDA1_MASK                      0x00000002
#define _IOCPDA_CNPDA1_LENGTH                    0x00000001

#define _IOCPDA_CNPDA2_POSITION                  0x00000002
#define _IOCPDA_CNPDA2_MASK                      0x00000004
#define _IOCPDA_CNPDA2_LENGTH                    0x00000001

#define _IOCPDA_CNPDA3_POSITION                  0x00000003
#define _IOCPDA_CNPDA3_MASK                      0x00000008
#define _IOCPDA_CNPDA3_LENGTH                    0x00000001

#define _IOCPDA_CNPDA4_POSITION                  0x00000004
#define _IOCPDA_CNPDA4_MASK                      0x00000010
#define _IOCPDA_CNPDA4_LENGTH                    0x00000001

#define _IOCPDA_CNPDA5_POSITION                  0x00000005
#define _IOCPDA_CNPDA5_MASK                      0x00000020
#define _IOCPDA_CNPDA5_LENGTH                    0x00000001

#define _IOCPDA_CNPDA6_POSITION                  0x00000006
#define _IOCPDA_CNPDA6_MASK                      0x00000040
#define _IOCPDA_CNPDA6_LENGTH                    0x00000001

#define _IOCPDA_CNPDA7_POSITION                  0x00000007
#define _IOCPDA_CNPDA7_MASK                      0x00000080
#define _IOCPDA_CNPDA7_LENGTH                    0x00000001

#define _IOCPDA_CNPDA9_POSITION                  0x00000009
#define _IOCPDA_CNPDA9_MASK                      0x00000200
#define _IOCPDA_CNPDA9_LENGTH                    0x00000001

#define _IOCPDA_CNPDA10_POSITION                 0x0000000A
#define _IOCPDA_CNPDA10_MASK                     0x00000400
#define _IOCPDA_CNPDA10_LENGTH                   0x00000001

#define _IOCPDA_CNPDA14_POSITION                 0x0000000E
#define _IOCPDA_CNPDA14_MASK                     0x00004000
#define _IOCPDA_CNPDA14_LENGTH                   0x00000001

#define _IOCPDA_CNPDA15_POSITION                 0x0000000F
#define _IOCPDA_CNPDA15_MASK                     0x00008000
#define _IOCPDA_CNPDA15_LENGTH                   0x00000001

#define _TRISB_TRISB0_POSITION                   0x00000000
#define _TRISB_TRISB0_MASK                       0x00000001
#define _TRISB_TRISB0_LENGTH                     0x00000001

#define _TRISB_TRISB1_POSITION                   0x00000001
#define _TRISB_TRISB1_MASK                       0x00000002
#define _TRISB_TRISB1_LENGTH                     0x00000001

#define _TRISB_TRISB2_POSITION                   0x00000002
#define _TRISB_TRISB2_MASK                       0x00000004
#define _TRISB_TRISB2_LENGTH                     0x00000001

#define _TRISB_TRISB3_POSITION                   0x00000003
#define _TRISB_TRISB3_MASK                       0x00000008
#define _TRISB_TRISB3_LENGTH                     0x00000001

#define _TRISB_TRISB4_POSITION                   0x00000004
#define _TRISB_TRISB4_MASK                       0x00000010
#define _TRISB_TRISB4_LENGTH                     0x00000001

#define _TRISB_TRISB5_POSITION                   0x00000005
#define _TRISB_TRISB5_MASK                       0x00000020
#define _TRISB_TRISB5_LENGTH                     0x00000001

#define _TRISB_TRISB6_POSITION                   0x00000006
#define _TRISB_TRISB6_MASK                       0x00000040
#define _TRISB_TRISB6_LENGTH                     0x00000001

#define _TRISB_TRISB7_POSITION                   0x00000007
#define _TRISB_TRISB7_MASK                       0x00000080
#define _TRISB_TRISB7_LENGTH                     0x00000001

#define _TRISB_TRISB8_POSITION                   0x00000008
#define _TRISB_TRISB8_MASK                       0x00000100
#define _TRISB_TRISB8_LENGTH                     0x00000001

#define _TRISB_TRISB9_POSITION                   0x00000009
#define _TRISB_TRISB9_MASK                       0x00000200
#define _TRISB_TRISB9_LENGTH                     0x00000001

#define _TRISB_TRISB10_POSITION                  0x0000000A
#define _TRISB_TRISB10_MASK                      0x00000400
#define _TRISB_TRISB10_LENGTH                    0x00000001

#define _TRISB_TRISB11_POSITION                  0x0000000B
#define _TRISB_TRISB11_MASK                      0x00000800
#define _TRISB_TRISB11_LENGTH                    0x00000001

#define _TRISB_TRISB12_POSITION                  0x0000000C
#define _TRISB_TRISB12_MASK                      0x00001000
#define _TRISB_TRISB12_LENGTH                    0x00000001

#define _TRISB_TRISB13_POSITION                  0x0000000D
#define _TRISB_TRISB13_MASK                      0x00002000
#define _TRISB_TRISB13_LENGTH                    0x00000001

#define _TRISB_TRISB14_POSITION                  0x0000000E
#define _TRISB_TRISB14_MASK                      0x00004000
#define _TRISB_TRISB14_LENGTH                    0x00000001

#define _TRISB_TRISB15_POSITION                  0x0000000F
#define _TRISB_TRISB15_MASK                      0x00008000
#define _TRISB_TRISB15_LENGTH                    0x00000001

#define _PORTB_RB0_POSITION                      0x00000000
#define _PORTB_RB0_MASK                          0x00000001
#define _PORTB_RB0_LENGTH                        0x00000001

#define _PORTB_RB1_POSITION                      0x00000001
#define _PORTB_RB1_MASK                          0x00000002
#define _PORTB_RB1_LENGTH                        0x00000001

#define _PORTB_RB2_POSITION                      0x00000002
#define _PORTB_RB2_MASK                          0x00000004
#define _PORTB_RB2_LENGTH                        0x00000001

#define _PORTB_RB3_POSITION                      0x00000003
#define _PORTB_RB3_MASK                          0x00000008
#define _PORTB_RB3_LENGTH                        0x00000001

#define _PORTB_RB4_POSITION                      0x00000004
#define _PORTB_RB4_MASK                          0x00000010
#define _PORTB_RB4_LENGTH                        0x00000001

#define _PORTB_RB5_POSITION                      0x00000005
#define _PORTB_RB5_MASK                          0x00000020
#define _PORTB_RB5_LENGTH                        0x00000001

