MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA610/mcu.h
#define _IOCPDB_IOCPDB13_POSITION                0x0000000D
#define _IOCPDB_IOCPDB13_MASK                    0x00002000
#define _IOCPDB_IOCPDB13_LENGTH                  0x00000001

#define _IOCPDB_IOCPDB14_POSITION                0x0000000E
#define _IOCPDB_IOCPDB14_MASK                    0x00004000
#define _IOCPDB_IOCPDB14_LENGTH                  0x00000001

#define _IOCPDB_IOCPDB15_POSITION                0x0000000F
#define _IOCPDB_IOCPDB15_MASK                    0x00008000
#define _IOCPDB_IOCPDB15_LENGTH                  0x00000001

#define _IOCPDB_CNPDB0_POSITION                  0x00000000
#define _IOCPDB_CNPDB0_MASK                      0x00000001
#define _IOCPDB_CNPDB0_LENGTH                    0x00000001

#define _IOCPDB_CNPDB1_POSITION                  0x00000001
#define _IOCPDB_CNPDB1_MASK                      0x00000002
#define _IOCPDB_CNPDB1_LENGTH                    0x00000001

#define _IOCPDB_CNPDB2_POSITION                  0x00000002
#define _IOCPDB_CNPDB2_MASK                      0x00000004
#define _IOCPDB_CNPDB2_LENGTH                    0x00000001

#define _IOCPDB_CNPDB3_POSITION                  0x00000003
#define _IOCPDB_CNPDB3_MASK                      0x00000008
#define _IOCPDB_CNPDB3_LENGTH                    0x00000001

#define _IOCPDB_CNPDB4_POSITION                  0x00000004
#define _IOCPDB_CNPDB4_MASK                      0x00000010
#define _IOCPDB_CNPDB4_LENGTH                    0x00000001

#define _IOCPDB_CNPDB5_POSITION                  0x00000005
#define _IOCPDB_CNPDB5_MASK                      0x00000020
#define _IOCPDB_CNPDB5_LENGTH                    0x00000001

#define _IOCPDB_CNPDB6_POSITION                  0x00000006
#define _IOCPDB_CNPDB6_MASK                      0x00000040
#define _IOCPDB_CNPDB6_LENGTH                    0x00000001

#define _IOCPDB_CNPDB7_POSITION                  0x00000007
#define _IOCPDB_CNPDB7_MASK                      0x00000080
#define _IOCPDB_CNPDB7_LENGTH                    0x00000001

#define _IOCPDB_CNPDB8_POSITION                  0x00000008
#define _IOCPDB_CNPDB8_MASK                      0x00000100
#define _IOCPDB_CNPDB8_LENGTH                    0x00000001

#define _IOCPDB_CNPDB9_POSITION                  0x00000009
#define _IOCPDB_CNPDB9_MASK                      0x00000200
#define _IOCPDB_CNPDB9_LENGTH                    0x00000001

#define _IOCPDB_CNPDB10_POSITION                 0x0000000A
#define _IOCPDB_CNPDB10_MASK                     0x00000400
#define _IOCPDB_CNPDB10_LENGTH                   0x00000001

#define _IOCPDB_CNPDB11_POSITION                 0x0000000B
#define _IOCPDB_CNPDB11_MASK                     0x00000800
#define _IOCPDB_CNPDB11_LENGTH                   0x00000001

#define _IOCPDB_CNPDB12_POSITION                 0x0000000C
#define _IOCPDB_CNPDB12_MASK                     0x00001000
#define _IOCPDB_CNPDB12_LENGTH                   0x00000001

#define _IOCPDB_CNPDB13_POSITION                 0x0000000D
#define _IOCPDB_CNPDB13_MASK                     0x00002000
#define _IOCPDB_CNPDB13_LENGTH                   0x00000001

#define _IOCPDB_CNPDB14_POSITION                 0x0000000E
#define _IOCPDB_CNPDB14_MASK                     0x00004000
#define _IOCPDB_CNPDB14_LENGTH                   0x00000001

#define _IOCPDB_CNPDB15_POSITION                 0x0000000F
#define _IOCPDB_CNPDB15_MASK                     0x00008000
#define _IOCPDB_CNPDB15_LENGTH                   0x00000001

#define _TRISC_TRISC1_POSITION                   0x00000001
#define _TRISC_TRISC1_MASK                       0x00000002
#define _TRISC_TRISC1_LENGTH                     0x00000001

#define _TRISC_TRISC2_POSITION                   0x00000002
#define _TRISC_TRISC2_MASK                       0x00000004
#define _TRISC_TRISC2_LENGTH                     0x00000001

#define _TRISC_TRISC3_POSITION                   0x00000003
#define _TRISC_TRISC3_MASK                       0x00000008
#define _TRISC_TRISC3_LENGTH                     0x00000001

#define _TRISC_TRISC4_POSITION                   0x00000004
#define _TRISC_TRISC4_MASK                       0x00000010
#define _TRISC_TRISC4_LENGTH                     0x00000001

#define _TRISC_TRISC12_POSITION                  0x0000000C
#define _TRISC_TRISC12_MASK                      0x00001000
#define _TRISC_TRISC12_LENGTH                    0x00000001

#define _TRISC_TRISC13_POSITION                  0x0000000D
#define _TRISC_TRISC13_MASK                      0x00002000
#define _TRISC_TRISC13_LENGTH                    0x00000001

#define _TRISC_TRISC14_POSITION                  0x0000000E
#define _TRISC_TRISC14_MASK                      0x00004000
#define _TRISC_TRISC14_LENGTH                    0x00000001

#define _TRISC_TRISC15_POSITION                  0x0000000F
#define _TRISC_TRISC15_MASK                      0x00008000
#define _TRISC_TRISC15_LENGTH                    0x00000001

#define _PORTC_RC1_POSITION                      0x00000001
#define _PORTC_RC1_MASK                          0x00000002
#define _PORTC_RC1_LENGTH                        0x00000001

#define _PORTC_RC2_POSITION                      0x00000002
#define _PORTC_RC2_MASK                          0x00000004
#define _PORTC_RC2_LENGTH                        0x00000001

#define _PORTC_RC3_POSITION                      0x00000003
#define _PORTC_RC3_MASK                          0x00000008
#define _PORTC_RC3_LENGTH                        0x00000001

#define _PORTC_RC4_POSITION                      0x00000004
#define _PORTC_RC4_MASK                          0x00000010
#define _PORTC_RC4_LENGTH                        0x00000001

#define _PORTC_RC12_POSITION                     0x0000000C
#define _PORTC_RC12_MASK                         0x00001000
#define _PORTC_RC12_LENGTH                       0x00000001

#define _PORTC_RC13_POSITION                     0x0000000D
#define _PORTC_RC13_MASK                         0x00002000
#define _PORTC_RC13_LENGTH                       0x00000001

#define _PORTC_RC14_POSITION                     0x0000000E
#define _PORTC_RC14_MASK                         0x00004000
#define _PORTC_RC14_LENGTH                       0x00000001

#define _PORTC_RC15_POSITION                     0x0000000F
#define _PORTC_RC15_MASK                         0x00008000
#define _PORTC_RC15_LENGTH                       0x00000001

#define _LATC_LATC1_POSITION                     0x00000001
#define _LATC_LATC1_MASK                         0x00000002
#define _LATC_LATC1_LENGTH                       0x00000001

#define _LATC_LATC2_POSITION                     0x00000002
#define _LATC_LATC2_MASK                         0x00000004
#define _LATC_LATC2_LENGTH                       0x00000001

