MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA610/mcu.h
#define _LATC_LATC3_POSITION                     0x00000003
#define _LATC_LATC3_MASK                         0x00000008
#define _LATC_LATC3_LENGTH                       0x00000001

#define _LATC_LATC4_POSITION                     0x00000004
#define _LATC_LATC4_MASK                         0x00000010
#define _LATC_LATC4_LENGTH                       0x00000001

#define _LATC_LATC12_POSITION                    0x0000000C
#define _LATC_LATC12_MASK                        0x00001000
#define _LATC_LATC12_LENGTH                      0x00000001

#define _LATC_LATC13_POSITION                    0x0000000D
#define _LATC_LATC13_MASK                        0x00002000
#define _LATC_LATC13_LENGTH                      0x00000001

#define _LATC_LATC14_POSITION                    0x0000000E
#define _LATC_LATC14_MASK                        0x00004000
#define _LATC_LATC14_LENGTH                      0x00000001

#define _LATC_LATC15_POSITION                    0x0000000F
#define _LATC_LATC15_MASK                        0x00008000
#define _LATC_LATC15_LENGTH                      0x00000001

#define _ODCC_ODCC1_POSITION                     0x00000001
#define _ODCC_ODCC1_MASK                         0x00000002
#define _ODCC_ODCC1_LENGTH                       0x00000001

#define _ODCC_ODCC2_POSITION                     0x00000002
#define _ODCC_ODCC2_MASK                         0x00000004
#define _ODCC_ODCC2_LENGTH                       0x00000001

#define _ODCC_ODCC3_POSITION                     0x00000003
#define _ODCC_ODCC3_MASK                         0x00000008
#define _ODCC_ODCC3_LENGTH                       0x00000001

#define _ODCC_ODCC4_POSITION                     0x00000004
#define _ODCC_ODCC4_MASK                         0x00000010
#define _ODCC_ODCC4_LENGTH                       0x00000001

#define _ODCC_ODCC12_POSITION                    0x0000000C
#define _ODCC_ODCC12_MASK                        0x00001000
#define _ODCC_ODCC12_LENGTH                      0x00000001

#define _ODCC_ODCC13_POSITION                    0x0000000D
#define _ODCC_ODCC13_MASK                        0x00002000
#define _ODCC_ODCC13_LENGTH                      0x00000001

#define _ODCC_ODCC14_POSITION                    0x0000000E
#define _ODCC_ODCC14_MASK                        0x00004000
#define _ODCC_ODCC14_LENGTH                      0x00000001

#define _ODCC_ODCC15_POSITION                    0x0000000F
#define _ODCC_ODCC15_MASK                        0x00008000
#define _ODCC_ODCC15_LENGTH                      0x00000001

#define _ANSC_ANSC4_POSITION                     0x00000004
#define _ANSC_ANSC4_MASK                         0x00000010
#define _ANSC_ANSC4_LENGTH                       0x00000001

#define _ANSC_ANSC13_POSITION                    0x0000000D
#define _ANSC_ANSC13_MASK                        0x00002000
#define _ANSC_ANSC13_LENGTH                      0x00000001

#define _ANSC_ANSC14_POSITION                    0x0000000E
#define _ANSC_ANSC14_MASK                        0x00004000
#define _ANSC_ANSC14_LENGTH                      0x00000001

#define _ANSC_ANSELC4_POSITION                   0x00000004
#define _ANSC_ANSELC4_MASK                       0x00000010
#define _ANSC_ANSELC4_LENGTH                     0x00000001

#define _ANSC_ANSELC13_POSITION                  0x0000000D
#define _ANSC_ANSELC13_MASK                      0x00002000
#define _ANSC_ANSELC13_LENGTH                    0x00000001

#define _ANSC_ANSELC14_POSITION                  0x0000000E
#define _ANSC_ANSELC14_MASK                      0x00004000
#define _ANSC_ANSELC14_LENGTH                    0x00000001

#define _ANSELC_ANSC4_POSITION                   0x00000004
#define _ANSELC_ANSC4_MASK                       0x00000010
#define _ANSELC_ANSC4_LENGTH                     0x00000001

#define _ANSELC_ANSC13_POSITION                  0x0000000D
#define _ANSELC_ANSC13_MASK                      0x00002000
#define _ANSELC_ANSC13_LENGTH                    0x00000001

#define _ANSELC_ANSC14_POSITION                  0x0000000E
#define _ANSELC_ANSC14_MASK                      0x00004000
#define _ANSELC_ANSC14_LENGTH                    0x00000001

#define _ANSELC_ANSELC4_POSITION                 0x00000004
#define _ANSELC_ANSELC4_MASK                     0x00000010
#define _ANSELC_ANSELC4_LENGTH                   0x00000001

#define _ANSELC_ANSELC13_POSITION                0x0000000D
#define _ANSELC_ANSELC13_MASK                    0x00002000
#define _ANSELC_ANSELC13_LENGTH                  0x00000001

#define _ANSELC_ANSELC14_POSITION                0x0000000E
#define _ANSELC_ANSELC14_MASK                    0x00004000
#define _ANSELC_ANSELC14_LENGTH                  0x00000001

#define _IOCPC_IOCPC1_POSITION                   0x00000001
#define _IOCPC_IOCPC1_MASK                       0x00000002
#define _IOCPC_IOCPC1_LENGTH                     0x00000001

#define _IOCPC_IOCPC2_POSITION                   0x00000002
#define _IOCPC_IOCPC2_MASK                       0x00000004
#define _IOCPC_IOCPC2_LENGTH                     0x00000001

#define _IOCPC_IOCPC3_POSITION                   0x00000003
#define _IOCPC_IOCPC3_MASK                       0x00000008
#define _IOCPC_IOCPC3_LENGTH                     0x00000001

#define _IOCPC_IOCPC4_POSITION                   0x00000004
#define _IOCPC_IOCPC4_MASK                       0x00000010
#define _IOCPC_IOCPC4_LENGTH                     0x00000001

#define _IOCPC_IOCPC12_POSITION                  0x0000000C
#define _IOCPC_IOCPC12_MASK                      0x00001000
#define _IOCPC_IOCPC12_LENGTH                    0x00000001

#define _IOCPC_IOCPC13_POSITION                  0x0000000D
#define _IOCPC_IOCPC13_MASK                      0x00002000
#define _IOCPC_IOCPC13_LENGTH                    0x00000001

#define _IOCPC_IOCPC14_POSITION                  0x0000000E
#define _IOCPC_IOCPC14_MASK                      0x00004000
#define _IOCPC_IOCPC14_LENGTH                    0x00000001

#define _IOCPC_IOCPC15_POSITION                  0x0000000F
#define _IOCPC_IOCPC15_MASK                      0x00008000
#define _IOCPC_IOCPC15_LENGTH                    0x00000001

#define _IOCNC_IOCNC1_POSITION                   0x00000001
#define _IOCNC_IOCNC1_MASK                       0x00000002
#define _IOCNC_IOCNC1_LENGTH                     0x00000001

