MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA610/mcu.h
#define _CNPUC_CNPUC14_POSITION                  0x0000000E
#define _CNPUC_CNPUC14_MASK                      0x00004000
#define _CNPUC_CNPUC14_LENGTH                    0x00000001

#define _CNPUC_CNPUC15_POSITION                  0x0000000F
#define _CNPUC_CNPUC15_MASK                      0x00008000
#define _CNPUC_CNPUC15_LENGTH                    0x00000001

#define _IOCPUC_IOCPC1_POSITION                  0x00000001
#define _IOCPUC_IOCPC1_MASK                      0x00000002
#define _IOCPUC_IOCPC1_LENGTH                    0x00000001

#define _IOCPUC_IOCPC2_POSITION                  0x00000002
#define _IOCPUC_IOCPC2_MASK                      0x00000004
#define _IOCPUC_IOCPC2_LENGTH                    0x00000001

#define _IOCPUC_IOCPC3_POSITION                  0x00000003
#define _IOCPUC_IOCPC3_MASK                      0x00000008
#define _IOCPUC_IOCPC3_LENGTH                    0x00000001

#define _IOCPUC_IOCPC4_POSITION                  0x00000004
#define _IOCPUC_IOCPC4_MASK                      0x00000010
#define _IOCPUC_IOCPC4_LENGTH                    0x00000001

#define _IOCPUC_IOCPC12_POSITION                 0x0000000C
#define _IOCPUC_IOCPC12_MASK                     0x00001000
#define _IOCPUC_IOCPC12_LENGTH                   0x00000001

#define _IOCPUC_IOCPC13_POSITION                 0x0000000D
#define _IOCPUC_IOCPC13_MASK                     0x00002000
#define _IOCPUC_IOCPC13_LENGTH                   0x00000001

#define _IOCPUC_IOCPC14_POSITION                 0x0000000E
#define _IOCPUC_IOCPC14_MASK                     0x00004000
#define _IOCPUC_IOCPC14_LENGTH                   0x00000001

#define _IOCPUC_IOCPC15_POSITION                 0x0000000F
#define _IOCPUC_IOCPC15_MASK                     0x00008000
#define _IOCPUC_IOCPC15_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC1_POSITION                 0x00000001
#define _IOCPUC_IOCPUC1_MASK                     0x00000002
#define _IOCPUC_IOCPUC1_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC2_POSITION                 0x00000002
#define _IOCPUC_IOCPUC2_MASK                     0x00000004
#define _IOCPUC_IOCPUC2_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC3_POSITION                 0x00000003
#define _IOCPUC_IOCPUC3_MASK                     0x00000008
#define _IOCPUC_IOCPUC3_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC4_POSITION                 0x00000004
#define _IOCPUC_IOCPUC4_MASK                     0x00000010
#define _IOCPUC_IOCPUC4_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC12_POSITION                0x0000000C
#define _IOCPUC_IOCPUC12_MASK                    0x00001000
#define _IOCPUC_IOCPUC12_LENGTH                  0x00000001

#define _IOCPUC_IOCPUC13_POSITION                0x0000000D
#define _IOCPUC_IOCPUC13_MASK                    0x00002000
#define _IOCPUC_IOCPUC13_LENGTH                  0x00000001

#define _IOCPUC_IOCPUC14_POSITION                0x0000000E
#define _IOCPUC_IOCPUC14_MASK                    0x00004000
#define _IOCPUC_IOCPUC14_LENGTH                  0x00000001

#define _IOCPUC_IOCPUC15_POSITION                0x0000000F
#define _IOCPUC_IOCPUC15_MASK                    0x00008000
#define _IOCPUC_IOCPUC15_LENGTH                  0x00000001

#define _IOCPUC_CNPUC1_POSITION                  0x00000001
#define _IOCPUC_CNPUC1_MASK                      0x00000002
#define _IOCPUC_CNPUC1_LENGTH                    0x00000001

#define _IOCPUC_CNPUC2_POSITION                  0x00000002
#define _IOCPUC_CNPUC2_MASK                      0x00000004
#define _IOCPUC_CNPUC2_LENGTH                    0x00000001

#define _IOCPUC_CNPUC3_POSITION                  0x00000003
#define _IOCPUC_CNPUC3_MASK                      0x00000008
#define _IOCPUC_CNPUC3_LENGTH                    0x00000001

#define _IOCPUC_CNPUC4_POSITION                  0x00000004
#define _IOCPUC_CNPUC4_MASK                      0x00000010
#define _IOCPUC_CNPUC4_LENGTH                    0x00000001

#define _IOCPUC_CNPUC12_POSITION                 0x0000000C
#define _IOCPUC_CNPUC12_MASK                     0x00001000
#define _IOCPUC_CNPUC12_LENGTH                   0x00000001

#define _IOCPUC_CNPUC13_POSITION                 0x0000000D
#define _IOCPUC_CNPUC13_MASK                     0x00002000
#define _IOCPUC_CNPUC13_LENGTH                   0x00000001

#define _IOCPUC_CNPUC14_POSITION                 0x0000000E
#define _IOCPUC_CNPUC14_MASK                     0x00004000
#define _IOCPUC_CNPUC14_LENGTH                   0x00000001

#define _IOCPUC_CNPUC15_POSITION                 0x0000000F
#define _IOCPUC_CNPUC15_MASK                     0x00008000
#define _IOCPUC_CNPUC15_LENGTH                   0x00000001

#define _CNPDC_IOCPDC1_POSITION                  0x00000001
#define _CNPDC_IOCPDC1_MASK                      0x00000002
#define _CNPDC_IOCPDC1_LENGTH                    0x00000001

#define _CNPDC_IOCPDC2_POSITION                  0x00000002
#define _CNPDC_IOCPDC2_MASK                      0x00000004
#define _CNPDC_IOCPDC2_LENGTH                    0x00000001

#define _CNPDC_IOCPDC3_POSITION                  0x00000003
#define _CNPDC_IOCPDC3_MASK                      0x00000008
#define _CNPDC_IOCPDC3_LENGTH                    0x00000001

#define _CNPDC_IOCPDC4_POSITION                  0x00000004
#define _CNPDC_IOCPDC4_MASK                      0x00000010
#define _CNPDC_IOCPDC4_LENGTH                    0x00000001

#define _CNPDC_IOCPDC12_POSITION                 0x0000000C
#define _CNPDC_IOCPDC12_MASK                     0x00001000
#define _CNPDC_IOCPDC12_LENGTH                   0x00000001

#define _CNPDC_IOCPDC13_POSITION                 0x0000000D
#define _CNPDC_IOCPDC13_MASK                     0x00002000
#define _CNPDC_IOCPDC13_LENGTH                   0x00000001

#define _CNPDC_IOCPDC14_POSITION                 0x0000000E
#define _CNPDC_IOCPDC14_MASK                     0x00004000
#define _CNPDC_IOCPDC14_LENGTH                   0x00000001

#define _CNPDC_IOCPDC15_POSITION                 0x0000000F
#define _CNPDC_IOCPDC15_MASK                     0x00008000
#define _CNPDC_IOCPDC15_LENGTH                   0x00000001

#define _CNPDC_CNPDC1_POSITION                   0x00000001
#define _CNPDC_CNPDC1_MASK                       0x00000002
#define _CNPDC_CNPDC1_LENGTH                     0x00000001

