MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA610/mcu.h
#define _IOCFD_IOCFD14_POSITION                  0x0000000E
#define _IOCFD_IOCFD14_MASK                      0x00004000
#define _IOCFD_IOCFD14_LENGTH                    0x00000001

#define _IOCFD_IOCFD15_POSITION                  0x0000000F
#define _IOCFD_IOCFD15_MASK                      0x00008000
#define _IOCFD_IOCFD15_LENGTH                    0x00000001

#define _CNPUD_IOCPD0_POSITION                   0x00000000
#define _CNPUD_IOCPD0_MASK                       0x00000001
#define _CNPUD_IOCPD0_LENGTH                     0x00000001

#define _CNPUD_IOCPD1_POSITION                   0x00000001
#define _CNPUD_IOCPD1_MASK                       0x00000002
#define _CNPUD_IOCPD1_LENGTH                     0x00000001

#define _CNPUD_IOCPD2_POSITION                   0x00000002
#define _CNPUD_IOCPD2_MASK                       0x00000004
#define _CNPUD_IOCPD2_LENGTH                     0x00000001

#define _CNPUD_IOCPD3_POSITION                   0x00000003
#define _CNPUD_IOCPD3_MASK                       0x00000008
#define _CNPUD_IOCPD3_LENGTH                     0x00000001

#define _CNPUD_IOCPD4_POSITION                   0x00000004
#define _CNPUD_IOCPD4_MASK                       0x00000010
#define _CNPUD_IOCPD4_LENGTH                     0x00000001

#define _CNPUD_IOCPD5_POSITION                   0x00000005
#define _CNPUD_IOCPD5_MASK                       0x00000020
#define _CNPUD_IOCPD5_LENGTH                     0x00000001

#define _CNPUD_IOCPD6_POSITION                   0x00000006
#define _CNPUD_IOCPD6_MASK                       0x00000040
#define _CNPUD_IOCPD6_LENGTH                     0x00000001

#define _CNPUD_IOCPD7_POSITION                   0x00000007
#define _CNPUD_IOCPD7_MASK                       0x00000080
#define _CNPUD_IOCPD7_LENGTH                     0x00000001

#define _CNPUD_IOCPD8_POSITION                   0x00000008
#define _CNPUD_IOCPD8_MASK                       0x00000100
#define _CNPUD_IOCPD8_LENGTH                     0x00000001

#define _CNPUD_IOCPD9_POSITION                   0x00000009
#define _CNPUD_IOCPD9_MASK                       0x00000200
#define _CNPUD_IOCPD9_LENGTH                     0x00000001

#define _CNPUD_IOCPD10_POSITION                  0x0000000A
#define _CNPUD_IOCPD10_MASK                      0x00000400
#define _CNPUD_IOCPD10_LENGTH                    0x00000001

#define _CNPUD_IOCPD11_POSITION                  0x0000000B
#define _CNPUD_IOCPD11_MASK                      0x00000800
#define _CNPUD_IOCPD11_LENGTH                    0x00000001

#define _CNPUD_IOCPD12_POSITION                  0x0000000C
#define _CNPUD_IOCPD12_MASK                      0x00001000
#define _CNPUD_IOCPD12_LENGTH                    0x00000001

#define _CNPUD_IOCPD13_POSITION                  0x0000000D
#define _CNPUD_IOCPD13_MASK                      0x00002000
#define _CNPUD_IOCPD13_LENGTH                    0x00000001

#define _CNPUD_IOCPD14_POSITION                  0x0000000E
#define _CNPUD_IOCPD14_MASK                      0x00004000
#define _CNPUD_IOCPD14_LENGTH                    0x00000001

#define _CNPUD_IOCPD15_POSITION                  0x0000000F
#define _CNPUD_IOCPD15_MASK                      0x00008000
#define _CNPUD_IOCPD15_LENGTH                    0x00000001

#define _CNPUD_IOCPUD0_POSITION                  0x00000000
#define _CNPUD_IOCPUD0_MASK                      0x00000001
#define _CNPUD_IOCPUD0_LENGTH                    0x00000001

#define _CNPUD_IOCPUD1_POSITION                  0x00000001
#define _CNPUD_IOCPUD1_MASK                      0x00000002
#define _CNPUD_IOCPUD1_LENGTH                    0x00000001

#define _CNPUD_IOCPUD2_POSITION                  0x00000002
#define _CNPUD_IOCPUD2_MASK                      0x00000004
#define _CNPUD_IOCPUD2_LENGTH                    0x00000001

#define _CNPUD_IOCPUD3_POSITION                  0x00000003
#define _CNPUD_IOCPUD3_MASK                      0x00000008
#define _CNPUD_IOCPUD3_LENGTH                    0x00000001

#define _CNPUD_IOCPUD4_POSITION                  0x00000004
#define _CNPUD_IOCPUD4_MASK                      0x00000010
#define _CNPUD_IOCPUD4_LENGTH                    0x00000001

#define _CNPUD_IOCPUD5_POSITION                  0x00000005
#define _CNPUD_IOCPUD5_MASK                      0x00000020
#define _CNPUD_IOCPUD5_LENGTH                    0x00000001

#define _CNPUD_IOCPUD6_POSITION                  0x00000006
#define _CNPUD_IOCPUD6_MASK                      0x00000040
#define _CNPUD_IOCPUD6_LENGTH                    0x00000001

#define _CNPUD_IOCPUD7_POSITION                  0x00000007
#define _CNPUD_IOCPUD7_MASK                      0x00000080
#define _CNPUD_IOCPUD7_LENGTH                    0x00000001

#define _CNPUD_IOCPUD8_POSITION                  0x00000008
#define _CNPUD_IOCPUD8_MASK                      0x00000100
#define _CNPUD_IOCPUD8_LENGTH                    0x00000001

#define _CNPUD_IOCPUD9_POSITION                  0x00000009
#define _CNPUD_IOCPUD9_MASK                      0x00000200
#define _CNPUD_IOCPUD9_LENGTH                    0x00000001

#define _CNPUD_IOCPUD10_POSITION                 0x0000000A
#define _CNPUD_IOCPUD10_MASK                     0x00000400
#define _CNPUD_IOCPUD10_LENGTH                   0x00000001

#define _CNPUD_IOCPUD11_POSITION                 0x0000000B
#define _CNPUD_IOCPUD11_MASK                     0x00000800
#define _CNPUD_IOCPUD11_LENGTH                   0x00000001

#define _CNPUD_IOCPUD12_POSITION                 0x0000000C
#define _CNPUD_IOCPUD12_MASK                     0x00001000
#define _CNPUD_IOCPUD12_LENGTH                   0x00000001

#define _CNPUD_IOCPUD13_POSITION                 0x0000000D
#define _CNPUD_IOCPUD13_MASK                     0x00002000
#define _CNPUD_IOCPUD13_LENGTH                   0x00000001

#define _CNPUD_IOCPUD14_POSITION                 0x0000000E
#define _CNPUD_IOCPUD14_MASK                     0x00004000
#define _CNPUD_IOCPUD14_LENGTH                   0x00000001

#define _CNPUD_IOCPUD15_POSITION                 0x0000000F
#define _CNPUD_IOCPUD15_MASK                     0x00008000
#define _CNPUD_IOCPUD15_LENGTH                   0x00000001

