MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA610/mcu.h
#define _IOCPDD_IOCPDD13_POSITION                0x0000000D
#define _IOCPDD_IOCPDD13_MASK                    0x00002000
#define _IOCPDD_IOCPDD13_LENGTH                  0x00000001

#define _IOCPDD_IOCPDD14_POSITION                0x0000000E
#define _IOCPDD_IOCPDD14_MASK                    0x00004000
#define _IOCPDD_IOCPDD14_LENGTH                  0x00000001

#define _IOCPDD_IOCPDD15_POSITION                0x0000000F
#define _IOCPDD_IOCPDD15_MASK                    0x00008000
#define _IOCPDD_IOCPDD15_LENGTH                  0x00000001

#define _IOCPDD_CNPDD0_POSITION                  0x00000000
#define _IOCPDD_CNPDD0_MASK                      0x00000001
#define _IOCPDD_CNPDD0_LENGTH                    0x00000001

#define _IOCPDD_CNPDD1_POSITION                  0x00000001
#define _IOCPDD_CNPDD1_MASK                      0x00000002
#define _IOCPDD_CNPDD1_LENGTH                    0x00000001

#define _IOCPDD_CNPDD2_POSITION                  0x00000002
#define _IOCPDD_CNPDD2_MASK                      0x00000004
#define _IOCPDD_CNPDD2_LENGTH                    0x00000001

#define _IOCPDD_CNPDD3_POSITION                  0x00000003
#define _IOCPDD_CNPDD3_MASK                      0x00000008
#define _IOCPDD_CNPDD3_LENGTH                    0x00000001

#define _IOCPDD_CNPDD4_POSITION                  0x00000004
#define _IOCPDD_CNPDD4_MASK                      0x00000010
#define _IOCPDD_CNPDD4_LENGTH                    0x00000001

#define _IOCPDD_CNPDD5_POSITION                  0x00000005
#define _IOCPDD_CNPDD5_MASK                      0x00000020
#define _IOCPDD_CNPDD5_LENGTH                    0x00000001

#define _IOCPDD_CNPDD6_POSITION                  0x00000006
#define _IOCPDD_CNPDD6_MASK                      0x00000040
#define _IOCPDD_CNPDD6_LENGTH                    0x00000001

#define _IOCPDD_CNPDD7_POSITION                  0x00000007
#define _IOCPDD_CNPDD7_MASK                      0x00000080
#define _IOCPDD_CNPDD7_LENGTH                    0x00000001

#define _IOCPDD_CNPDD8_POSITION                  0x00000008
#define _IOCPDD_CNPDD8_MASK                      0x00000100
#define _IOCPDD_CNPDD8_LENGTH                    0x00000001

#define _IOCPDD_CNPDD9_POSITION                  0x00000009
#define _IOCPDD_CNPDD9_MASK                      0x00000200
#define _IOCPDD_CNPDD9_LENGTH                    0x00000001

#define _IOCPDD_CNPDD10_POSITION                 0x0000000A
#define _IOCPDD_CNPDD10_MASK                     0x00000400
#define _IOCPDD_CNPDD10_LENGTH                   0x00000001

#define _IOCPDD_CNPDD11_POSITION                 0x0000000B
#define _IOCPDD_CNPDD11_MASK                     0x00000800
#define _IOCPDD_CNPDD11_LENGTH                   0x00000001

#define _IOCPDD_CNPDD12_POSITION                 0x0000000C
#define _IOCPDD_CNPDD12_MASK                     0x00001000
#define _IOCPDD_CNPDD12_LENGTH                   0x00000001

#define _IOCPDD_CNPDD13_POSITION                 0x0000000D
#define _IOCPDD_CNPDD13_MASK                     0x00002000
#define _IOCPDD_CNPDD13_LENGTH                   0x00000001

#define _IOCPDD_CNPDD14_POSITION                 0x0000000E
#define _IOCPDD_CNPDD14_MASK                     0x00004000
#define _IOCPDD_CNPDD14_LENGTH                   0x00000001

#define _IOCPDD_CNPDD15_POSITION                 0x0000000F
#define _IOCPDD_CNPDD15_MASK                     0x00008000
#define _IOCPDD_CNPDD15_LENGTH                   0x00000001

#define _TRISE_TRISE0_POSITION                   0x00000000
#define _TRISE_TRISE0_MASK                       0x00000001
#define _TRISE_TRISE0_LENGTH                     0x00000001

#define _TRISE_TRISE1_POSITION                   0x00000001
#define _TRISE_TRISE1_MASK                       0x00000002
#define _TRISE_TRISE1_LENGTH                     0x00000001

#define _TRISE_TRISE2_POSITION                   0x00000002
#define _TRISE_TRISE2_MASK                       0x00000004
#define _TRISE_TRISE2_LENGTH                     0x00000001

#define _TRISE_TRISE3_POSITION                   0x00000003
#define _TRISE_TRISE3_MASK                       0x00000008
#define _TRISE_TRISE3_LENGTH                     0x00000001

#define _TRISE_TRISE4_POSITION                   0x00000004
#define _TRISE_TRISE4_MASK                       0x00000010
#define _TRISE_TRISE4_LENGTH                     0x00000001

#define _TRISE_TRISE5_POSITION                   0x00000005
#define _TRISE_TRISE5_MASK                       0x00000020
#define _TRISE_TRISE5_LENGTH                     0x00000001

#define _TRISE_TRISE6_POSITION                   0x00000006
#define _TRISE_TRISE6_MASK                       0x00000040
#define _TRISE_TRISE6_LENGTH                     0x00000001

#define _TRISE_TRISE7_POSITION                   0x00000007
#define _TRISE_TRISE7_MASK                       0x00000080
#define _TRISE_TRISE7_LENGTH                     0x00000001

#define _TRISE_TRISE8_POSITION                   0x00000008
#define _TRISE_TRISE8_MASK                       0x00000100
#define _TRISE_TRISE8_LENGTH                     0x00000001

#define _TRISE_TRISE9_POSITION                   0x00000009
#define _TRISE_TRISE9_MASK                       0x00000200
#define _TRISE_TRISE9_LENGTH                     0x00000001

#define _PORTE_RE0_POSITION                      0x00000000
#define _PORTE_RE0_MASK                          0x00000001
#define _PORTE_RE0_LENGTH                        0x00000001

#define _PORTE_RE1_POSITION                      0x00000001
#define _PORTE_RE1_MASK                          0x00000002
#define _PORTE_RE1_LENGTH                        0x00000001

#define _PORTE_RE2_POSITION                      0x00000002
#define _PORTE_RE2_MASK                          0x00000004
#define _PORTE_RE2_LENGTH                        0x00000001

#define _PORTE_RE3_POSITION                      0x00000003
#define _PORTE_RE3_MASK                          0x00000008
#define _PORTE_RE3_LENGTH                        0x00000001

#define _PORTE_RE4_POSITION                      0x00000004
#define _PORTE_RE4_MASK                          0x00000010
#define _PORTE_RE4_LENGTH                        0x00000001

#define _PORTE_RE5_POSITION                      0x00000005
#define _PORTE_RE5_MASK                          0x00000020
#define _PORTE_RE5_LENGTH                        0x00000001

