MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA610/mcu.h
/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Brown Out Enable bit:
**     BOREN_OFF            Brown Out Disabled
**     SWC                  Controlled by SBOREN
**     BOREN_NOSLP          Disabled for Sleep Modes
**     BOREN_ON             Brown Out Enable Bit
**
**   Low power regulator control:
**     LPCFG_ON             Retention Sleep controlled by RETEN
**     LPCFG_OFF            No Retention Sleep
**
**   Downside Voltage Protection Enable bit:
**     DNVPEN_DISABLE       Downside protection disabled when BOR is inactive
**     DNVPEN_ENABLE        Downside protection enabled using ZPBOR when BOR is inactive
**
*/

#define BOREN_OFF            0x000C
#define SWC                  0x000D
#define BOREN_NOSLP          0x000E
#define BOREN_ON             0x000F

#define LPCFG_ON             0x000B
#define LPCFG_OFF            0x000F

#define DNVPEN_DISABLE       0x0007
#define DNVPEN_ENABLE        0x000F

/* Register FICD (0x2af28)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0x2af28),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Communication Channel Select bits:
**     ICS_NONE             Reserved, do not use
**     PGX3                 Communicate on PGEC3 and PGED3
**     PGX2                 Communicate on PGEC2 and PGED2
**     PGX1                 Communicate on PGEC1 and PGED1
**     ICS_PGX1             Communicate on PGEC1 and PGED1
**
**   JTAG Enable bit:
**     JTAGEN_OFF           JTAG is disabled
**     JTAGEN_ON            JTAG is enabled
**
**   BOOTSWP Disable:
**     BTSWP_ON             BOOTSWP instruction is enabled
**     BTSWP_OFF            BOOTSWP instruction disabled
**
*/

#define ICS_NONE             0x80A0
#define PGX3                 0x80A1
#define PGX2                 0x80A2
#define PGX1                 0x80A3
#define ICS_PGX1             0x80A3

#define JTAGEN_OFF           0x8083
#define JTAGEN_ON            0x80A3

#define BTSWP_ON             0x00A3
#define BTSWP_OFF            0x80A3

/* Register FDEVOPT1 (0x2af2c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDEVOPT1;
#define _FDEVOPT1(x) __attribute__((address(0x2af2c),deprecated_definition("consider migrating to #pragma config"),section("__FDEVOPT1.sec"),space(prog))) __prog__ uint16_t _FDEVOPT1 = (x);

/*
** Only one invocation of FDEVOPT1 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDEVOPT1.
** Multiple options may be combined, as shown:
**
** _FDEVOPT1( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Alternate Comparator Input Enable bit:
**     ALTCMPI_ENABLE       C1INC, C2INC and C3INC are on RG9
**     ALTCMPI_DISABLE      C1INC, C2INC, and C3INC are on their standard pin locations
**
**   Tamper Pin Enable bit:
**     TMPRPIN_ON           TMPRN pin function is enabled
**     TMPRPIN_OFF          TMPRN pin function is disabled
**
**   SOSC High Power Enable bit (valid only when SOSCSEL = 1:
**     SOSCHP_OFF           Enable SOSC low power mode
**     SOSCHP_ON            Enable SOSC high power mode (default)
**
**   Alternate Voltage Reference Location Enable bit:
**     ALTVREF_ALTVREFDIS   VREF+ and CVREF+ on RB0, VREF- and CVREF- on RB1
**     ALTVREF_ALTREFEN     VREF+ and CVREF+ on RA10, VREF- and CVREF- on RA9
**
*/

#define ALTCMPI_ENABLE       0x001C
#define ALTCMPI_DISABLE      0x001E

#define TMPRPIN_ON           0x001A
#define TMPRPIN_OFF          0x001E

#define SOSCHP_OFF           0x0016
#define SOSCHP_ON            0x001E

#define ALTVREF_ALTVREFDIS   0x000E
#define ALTVREF_ALTREFEN     0x001E

#endif

/* Fuses that are only present in dual panel mode */

#ifdef __DUAL_PARTITION
/* Register FSEC (0x15700)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSEC;
#define _FSEC(x) __attribute__((address(0x15700),deprecated_definition("consider migrating to #pragma config"),section("__FSEC.sec"),space(prog))) __prog__ uint16_t _FSEC = (x);

/*
** Only one invocation of FSEC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSEC.
** Multiple options may be combined, as shown:
**
** _FSEC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Write-Protect bit:
**     BWRP_ON              Boot Segment is write protected
**     BWRP_OFF             Boot Segment may be written
**
**   Boot Segment Code-Protect Level bits:
**     BSS_HI               High Security
**     BSS_STD              Standard Security
**     BSS_OFF              No Protection (other than BWRP)
**
**   Boot Segment Control bit:
**     BSEN_ON              Boot Segment size determined by FBSLIM
**     BSEN_OFF             No Boot Segment
**
**   General Segment Write-Protect bit:
**     GWRP_ON              General Segment is write protected
**     GWRP_OFF             General Segment may be written
**
**   General Segment Code-Protect Level bits:
**     GSS_HI               High Security
**     GSS_STD              Standard Security
**     GSS_OFF              No Protection (other than GWRP)
**
**   Configuration Segment Write-Protect bit:
**     CWRP_ON              Configuration Segment is write protected
**     CWRP_OFF             Configuration Segment may be written
**
**   Configuration Segment Code-Protect Level bits:
**     CSS_HI               High Security
**     CSS_ENH              Enhanced Security
**     CSS_STD              Standard Security
**     CSS_DIS              No Protection (other than CWRP)
**
**   Alternate Interrupt Vector Table bit:
**     AIVTDIS_ENABLE       Enabled AIVT
**     AIVTDIS_DISABLE      Disabled AIVT
**
*/

#define BWRP_ON              0x8FEE
#define BWRP_OFF             0x8FEF

#define BSS_HI               0x8FE9
#define BSS_STD              0x8FED
#define BSS_OFF              0x8FEF

